Dlubal.DynamPro.NVCParams
Natural vibration case parameters

Dlubal.DynamPro.NVCParams.Number
Natural vibration case number (read only)

Dlubal.DynamPro.NVCParams.Description
Description

Dlubal.DynamPro.NVCParams.ToSolve
Whether this NVC should be calculated in general calculation

Dlubal.DynamPro.NVCParams.NumberModeShapes
Number of lowest eigenvalue to calculate

Dlubal.DynamPro.NVCParams.FreqSearchEnabled
Enable frequency-close mode shapes search

Dlubal.DynamPro.NVCParams.FreqSearchFrequency
Frequency around which we search

Dlubal.DynamPro.NVCParams.MassCaseOrCombinationChoice
Whether import masses from mass case or mass combination

Dlubal.DynamPro.NVCParams.MassNo
Number of mass case or mass combination

Dlubal.DynamPro.NVCParams.ScalingOfModeShapesChoice
Method for scaling of mode shapes

Dlubal.DynamPro.NVCParams.SolutionMethod
Method for solving eigenvalue problem

Dlubal.DynamPro.NVCParams.MassCalculationSettings
Calculation settings related to mass

Dlubal.DynamPro.NVCParams.InitialConditionsSettings
Initial conditions settings

Dlubal.DynamPro.NVCParams.MemberDivisionSettings
Member divisions settings (only RSTAB)

Dlubal.DynamPro.NVCParams.ActivateGlobalStiffnessModification
Activate global stiffness modifications

Dlubal.DynamPro.NVCParams.Comment
Comment